Revit 2026 API

# FamilyInstanceFilter Properties

---

The FamilyInstanceFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilySymbolId | The family symbol id. |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

#### Reference

FamilyInstanceFilter Class

Autodesk.Revit.DB Namespace